#### 2021/11/29
#### https://datascienceschool.net/
#### 4.1.1, 4.1.2, 4.1.3, 4.3.1 연습문제

In [1]:
import numpy as np
import pandas as pd

## 연습 문제 4.1.1
- (1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

- (2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [2]:
a = pd.Series([101, 2254, 3415, 414], index=['가', '나', '다', '라'])
b = pd.Series([101, 244, 3415, 144], index=['가', '마', '다', '사'])
a, b

(가     101
 나    2254
 다    3415
 라     414
 dtype: int64,
 가     101
 마     244
 다    3415
 사     144
 dtype: int64)

In [3]:
a + 100, b - 50, a / 100, b * 2

(가     201
 나    2354
 다    3515
 라     514
 dtype: int64,
 가      51
 마     194
 다    3365
 사      94
 dtype: int64,
 가     1.01
 나    22.54
 다    34.15
 라     4.14
 dtype: float64,
 가     202
 마     488
 다    6830
 사     288
 dtype: int64)

In [4]:
a * b, a / b, a + b, a - b

(가       10201.0
 나           NaN
 다    11662225.0
 라           NaN
 마           NaN
 사           NaN
 dtype: float64,
 가    1.0
 나    NaN
 다    1.0
 라    NaN
 마    NaN
 사    NaN
 dtype: float64,
 가     202.0
 나       NaN
 다    6830.0
 라       NaN
 마       NaN
 사       NaN
 dtype: float64,
 가    0.0
 나    NaN
 다    0.0
 라    NaN
 마    NaN
 사    NaN
 dtype: float64)

## 연습 문제 4.1.2
- 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

    - (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

    - (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [7]:
data = {
    '1': [8, 'xl', 178.57, '바나나', 1000],
    '2': [5, 'wb', 157.5, '사과', 5000],
    '3': [2, 'lb', 124.7, '딸기', 3000],
    '4': [1, 'yb', 190.24, '포도', 4000],
    '5': [10, 'iq', 482.9, '아보카도', 200],
    '분류': ['횟수', '이름', '키', '구매 과일', '가격']
}
columns = ['1','2','3','4','5']
index = ['횟수', '이름', '키', '구매 과일', '가격']
df = pd.DataFrame(data, index=index, columns=columns)
df

            1      2      3       4      5
횟수          8      5      2       1     10
이름         xl     wb     lb      yb     iq
키      178.57  157.5  124.7  190.24  482.9
구매 과일     바나나     사과     딸기      포도   아보카도
가격       1000   5000   3000    4000    200

## 연습 문제 4.1.3
#### 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

- (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

- (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

- (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

- (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

- (5) 춘향의 점수를 데이터프레임으로 나타낸다.

- (6) 향단의 점수를 시리즈로 나타낸다.

In [9]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [10]:
# (1)
df['수학'] # 시리즈로 반환

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [13]:
df[['수학']] # 데이터프레임으로 반환

    수학
춘향  90
몽룡  60
향단  80
방자  70

In [12]:
# (2)
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [17]:
# (3)
df['평균'] = np.mean(df.values, axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67